#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	srand(time(NULL));
	//-------------------------------САМА ПРОГА-------------------------------------

	int x;
	int a, b;
	cout << "Введите число от 10 до 99:  ";
	cin >> x;

	b = x % 10;

	a = (x - b) / 10;

	if (a > b)
	{
		cout << a << " - большая цифра" << endl;
		cout << b << " - меньшая цифра" << endl;
	}
	else if (b > a)
	{
		cout << b << " - большая цифра" << endl;
		cout << a << " - меньшая цифра" << endl;
	}
	else
	{
		cout << "Цифры одинаковые  " << a << "  " << b << endl;
	}

	system("pause");

	return 0;
}
